// Graph(图) = Vertex(顶点) + Edge(边) 
/*
V = {element} E = {(A, B), (C, D)} 
一条边连接两个互为相邻点的邻接点 
对于无向图，对应顶点作为一个端点的边数即这个顶点的度数
对于有向图，度分为出度和入度，入度数即以对应的顶点为终点的入边数量，出度数即以对应的顶点为起点的出边数量
符合 V'包含于V 且 E'包含于E 的 图G' 被称为 图G的子图 
完全无向图: n * (n - 1) / 2 条边  
完全有向图: n * (n - 1) 条边 
图边数e << nlogn --> 稀疏图 图边数较多 --> 稠密图 
路径: 顶点序列  路径长度: 一条路径上经过的边的数目 
一条路径的顶点序列中顶点不重复出现，则称这条路径为简单路径 
若路径上起点和终点是同一个点则称这个路径为回路(环) 在此基础上还满足简单路径的定义的话则称之为简单回路 
若无向图中顶点之间形成路径，则这两个顶点之间是连通的 若无向图中任意两个顶点都是连通的，则这个图为连通图
极大连通子图称为图的连通分量  
对于有向图，若从顶点i到j和从顶点j到i都可形成路径，则称改图为强连通图
极大强连通子图称为图的强连通分量 
边上的数值成为权，边上带权的图称为带权图(网) 
*/


















































































































  
